# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\dgilliland\Documents\GitHub\Retro-Computers\Z80\PSOC\PSOC_Design_Files\PSOC4_FP_Mux\PSoc4_FP_Mux\PSoc4_FP_Mux.cydsn\PSoc4_FP_Mux.cyprj
# Date: Thu, 03 Oct 2019 17:31:34 GMT
#set_units -time ns
create_clock -name {I2CS_SCBCLK(FFB)} -period 625 -waveform {0 312.5} [list [get_pins {ClockBlock/ff_div_0}]]
create_clock -name {CyILO} -period 25000 -waveform {0 12500} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFClk} -period 25000 -waveform {0 12500} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFClk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySysClk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {I2CS_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 15 31} [list]


# Component constraints for C:\Users\dgilliland\Documents\GitHub\Retro-Computers\Z80\PSOC\PSOC_Design_Files\PSOC4_FP_Mux\PSoc4_FP_Mux\PSoc4_FP_Mux.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\dgilliland\Documents\GitHub\Retro-Computers\Z80\PSOC\PSOC_Design_Files\PSOC4_FP_Mux\PSoc4_FP_Mux\PSoc4_FP_Mux.cydsn\PSoc4_FP_Mux.cyprj
# Date: Thu, 03 Oct 2019 17:31:33 GMT
